In [1]:
import pandas as pd

In [24]:
data = {
    'EmployeeID':[101,102,103,104,105],
    'Name':['Alice','Bob','Charlie','David','Eva'],
    'Department':['HR','Engineering','Marketing','Engineering','Finance'],
    'Salary':[60000,80000,70000,90000,75000],
    'YearsOfExperience':[3,5,2,8,4]
}
workers_df=pd.DataFrame(data)

In [25]:
workers_df.head()

   EmployeeID     Name   Department  Salary  YearsOfExperience
0         101    Alice           HR   60000                  3
1         102      Bob  Engineering   80000                  5
2         103  Charlie    Marketing   70000                  2
3         104    David  Engineering   90000                  8
4         105      Eva      Finance   75000                  4

## 1.Question

In [4]:
## Find the avg salary for employee in the Company

In [26]:
Average_salary = workers_df['Salary'].mean()

In [27]:
Average_salary

np.float64(75000.0)

# 2.Question
## -What is the high salary in the marketing Department

In [28]:
high_salary_in_the_marketing = workers_df[workers_df['Department']=='Marketing']['Salary'].max()

In [29]:
high_salary_in_the_marketing

70000

# 3.Question
## Calculate the total years of experience in the company

In [30]:
total_Years_Of_Experience= workers_df['YearsOfExperience'].sum()

In [31]:
total_Years_Of_Experience

np.int64(22)

# 4.Question
## identify the employee with the high salary

In [33]:
employee_with_the_high_salary= workers_df[workers_ds['Salary']==workers_ds['Salary'].max()]
employee_with_the_high_salary

   EmployeeID   Name   Department  Salary  YearsOfExperience
3         104  David  Engineering   90000                  8

# 5.Question
## Calculate the avg salary for each department

In [39]:
avg_salary_for_each_department=workers_df.groupby('Department')['Salary'].mean()

# 6.Question
## find employee who have more than 4 years of experience and a salary about 80.000

In [43]:
Experience_and_salary= workers_df.query("Salary > 80000 and YearsOfExperience > 4")
Experience_and_salary

   EmployeeID   Name   Department  Salary  YearsOfExperience
3         104  David  Engineering   90000                  8

# 7.Question
## Calculate the total number of employees in each department

In [52]:
Employee_by_department= workers_df['Department'].value_counts()

In [53]:
Employee_by_department

Department
Engineering    2
HR             1
Marketing      1
Finance        1
Name: count, dtype: int64

# 8.Question
## Calculate the difference salary between the lowest and highest paid employee

In [55]:
difference_salary=workers_df['Salary'].max()-workers_df['Salary'].min()

In [56]:
difference_salary

30000

# 9.Question
## Identify the department with the highest average Years of experience

In [69]:
Departmenent_Years_experience_average= workers_df.groupby('Department')['YearsOfExperience'].mean()

In [71]:
Departmenent_Years_experience_average.idxmax()

'Engineering'

# 10.Question
## find employees with salary above the average salary

In [74]:
Emp_salary_above_avgs= workers_df[workers_df['Salary']>= workers_df['Salary'].mean()]

In [75]:
Emp_salary_above_avgs

   EmployeeID   Name   Department  Salary  YearsOfExperience
1         102    Bob  Engineering   80000                  5
3         104  David  Engineering   90000                  8
4         105    Eva      Finance   75000                  4

# 11.Question
## Determine the department with the most employees earning less than 70.000â‚¬

In [87]:
Emp_less_than_70000= workers_df.query('Salary < 70000')['Department']

In [88]:
Emp_less_than_70000

0    HR
Name: Department, dtype: object

# 12.Question
## Calculate the percentage of the total salary cost that the engineer in department contribute

In [89]:
workers_df

   EmployeeID     Name   Department  Salary  YearsOfExperience
0         101    Alice           HR   60000                  3
1         102      Bob  Engineering   80000                  5
2         103  Charlie    Marketing   70000                  2
3         104    David  Engineering   90000                  8
4         105      Eva      Finance   75000                  4

In [99]:
percentage_of_tt_sal= round(100*workers_df.query('Department == "Engineering"')['Salary'].sum() /workers_df['Salary'].sum(),2)

In [100]:
percentage_of_tt_sal

np.float64(45.33)

# 13.Question
## identify employees who have at least two years of experience more than the avg experience in the company

In [101]:
Employees_with_two_years_more_exp = workers_df[workers_df['YearsOfExperience']>(workers_df['YearsOfExperience'].mean()+2)]

In [102]:
Employees_with_two_years_more_exp

   EmployeeID   Name   Department  Salary  YearsOfExperience
3         104  David  Engineering   90000                  8

# 14.Question
## Calculate the average salary for employees in the marketing and finance departmenent

In [116]:
marketing_and_finance_avgsal= workers_df[workers_df["Department"].isin(["Marketing","Finance"])]['Salary'].mean()

In [117]:
marketing_and_finance_avgsal

np.float64(72500.0)

# 15.Question
## Find Department with the highest total salary cost

In [121]:
Department_with_the_highest_total_salary_cost=workers_df.groupby('Department')['Salary'].sum().idxmax()
Department_with_the_highest_total_salary_cost

'Engineering'